PH_data/alpha_1.0/0/TauDDES
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/






FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      TauDDES;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];


internalField   nonuniform List<symmTensor>
18009
(
( 3.031707274e-05 -4.922182598e-06 -3.728654292e-07 1.389503359e-05 -1.066336281e-07 3.02595472e-05 )
( 3.027461571e-05 -4.866880317e-06 -3.094109502e-07 1.380059621e-05 -1.026845311e-07 3.002853737e-05 )
( 3.010772707e-05 -4.063436791e-06 -2.634775456e-07 1.172131761e-05 -8.133925178e-08 3.0765048e-05 )
( 3.089042002e-05 -6.235539786e-06 -4.273368575e-07 1.688858356e-05 -1.763382755e-07 2.94014626e-05 )
( 3.009809734e-05 -4.019313565e-06 -2.31067915e-07 1.166330367e-05 -7.630966792e-08 3.062063479e-05 )
( 3.027328603e-05 -4.86410363e-06 -3.040531453e-07 1.379021433e-05 -1.026813763e-07 3.001296864e-05 )
( 2.995803879e-05 -3.158531626e-06 -1.535460115e-07 9.013168892e-06 -5.797312852e-08 3.118673339e-05 )
( 2.995786599e-05 -3.159688504e-06 -1.542164796e-07 9.014116586e-06 -5.806472103e-08 3.11910444e-05 )
...
)
;

boundaryField
{
    hill
    {
        type            calculated;
        value           uniform ( 0 0 0 0 0 0 );
    }
    top-wall
    {
        type            calculated;
        value           uniform ( 0 0 0 0 0 0 );
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
    cyclicAMI_outlet
    {
        type            cyclicAMI;
        value           uniform ( 0 0 0 0 0 0 );
    }
    cyclicAMI_inlet
    {
        type            cyclicAMI;
        value           uniform ( 0 0 0 0 0 0 );
    }
}


// ************************************************************************* //
