PH_data/alpha_1.0/0/UDDES
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/






FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      UDDES;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];


internalField   nonuniform List<vector> 
18009
(
( 0.006718855817 -0.0002163592144 1.446793885e-05 )
( 0.00680848863 -0.0002112991642 1.851655179e-05 )
( 0.00640859874 -0.0001696888939 8.122191502e-06 )
( 0.007278474513 -0.0002979362034 2.334218698e-05 )
( 0.006461037789 -0.0001674303057 1.106130821e-05 )
( 0.006815489382 -0.0002107685432 1.892397813e-05 )
( 0.005965474527 -0.0001150837925 4.006899871e-06 )
( 0.005964200944 -0.0001150626194 3.923368695e-06 )
...
)
;

boundaryField
{
    hill
    {
        type            calculated;
        value           uniform ( 0 0 0 );
    }
    top-wall
    {
        type            calculated;
        value           uniform ( 0 0 0 );
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
    cyclicAMI_outlet
    {
        type            cyclicAMI;
        value           uniform ( 0 0 0 );
    }
    cyclicAMI_inlet
    {
        type            cyclicAMI;
        value           uniform ( 0 0 0 );
    }
}


// ************************************************************************* //
